README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Literate programming avec Org mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Fabrice Niessen" />
<meta name="description" content="Fichier de démo pour la conférence GUTenberg 2021"
 />
<meta name="keywords" content="gutenberg, emacs, org-mode, latex, booster" />
</head>
<body>
<div id="content">
<h1 class="title">Literate programming avec Org mode</h1>
<p>
Ceci est un document Org.
</p>

<p>
<b>Org mode</b> est (entre autres) une syntaxe <i>plain text</i> facile à utiliser pour
rédiger des documents LaTeX, créer des pages Web, des documents LibreOffice et
encore plein d&rsquo;autres choses !
</p>

<div id="outline-container-org10255bc" class="outline-2">
<h2 id="org10255bc"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Excogitatum est super his, ut homines quidam ignoti, vilitate ipsa parum cavendi
ad colligendos rumores per Antiochiae latera cuncta destinarentur relaturi quae
audirent. hi peragranter et dissimulanter honoratorum circulis adsistendo
pervadendoque divites domus egentium habitu quicquid noscere poterant vel audire
latenter intromissi per posticas in regiam nuntiabant, id observantes
conspiratione concordi, ut fingerent quaedam et cognita duplicarent in peius,
laudes vero supprimerent Caesaris, quas invitis conpluribus formido malorum
inpendentium exprimebat.
</p>
</div>
</div>

<div id="outline-container-org2de1a2a" class="outline-2">
<h2 id="org2de1a2a"><span class="section-number-2">2</span> Équipements et tests</h2>
<div class="outline-text-2" id="text-2">
<p>
Post haec indumentum regale quaerebatur et ministris fucandae purpurae tortis
confessisque pectoralem tuniculam sine manicis textam, Maras nomine quidam
inductus est ut appellant Christiani diaconus.
</p>
</div>

<div id="outline-container-org6aee390" class="outline-3">
<h3 id="org6aee390"><span class="section-number-3">2.1</span> Équipements utilisés</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Superatis Tauri montis verticibus qui ad solis ortum sublimius attolluntur,
Cilicia spatiis porrigitur late distentis dives bonis omnibus terra, eiusque
lateri dextro adnexa Isauria, pari sorte uberi palmite viget et frugibus
minutis, quam mediam navigabile flumen Calycadnus interscindit :
</p>

<ul class="org-ul">
<li>ibi victu recreati et quiete,</li>
<li>postquam abierat timor,</li>
<li>vicos opulentos adorti equestrium adventu cohortium,</li>
<li>quae casu propinquabant.</li>
</ul>
</div>
</div>

<div id="outline-container-orge451964" class="outline-3">
<h3 id="orge451964"><span class="section-number-3">2.2</span> Conditions de tests</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Itaque tum Scaevola cum in eam ipsam mentionem incidisset, exposuit nobis
sermonem Laeli de amicitia habitum ab illo secum et cum altero genero, C. Fannio
Marci filio, paucis diebus post mortem Africani :
</p>

<ol class="org-ol">
<li>inter quos Paulus eminebat notarius ortus in Hispania,</li>
<li>glabro quidam sub vultu latens,</li>
<li>odorandi vias periculorum occultas perquam sagax.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org5a9d267" class="outline-2">
<h2 id="org5a9d267"><span class="section-number-2">3</span> Résultats et discussion</h2>
<div class="outline-text-2" id="text-3">
<p>
Hae duae provinciae bello quondam piratico catervis mixtae praedonum a Servilio
pro consule missae sub iugum factae sunt vectigales.
</p>

<table id="org802d991" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Jour</th>
<th scope="col" class="org-right">Frais</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Lundi</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">Mardi</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">Mercredi</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Jeudi</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Vendredi</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Samedi</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Dimanche</td>
<td class="org-right">0</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Total</td>
<td class="org-right">21</td>
</tr>
</tbody>
</table>

<p>
Quid?
</p>
</div>

<div id="outline-container-org9496031" class="outline-3">
<h3 id="org9496031"><span class="section-number-3">3.1</span> Résultats</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Coactique aliquotiens nostri pedites ad eos persequendos scandere clivos
sublimes etiam si lapsantibus plantis fruticeta prensando vel dumos ad vertices
venerint summos.
</p>
</div>
</div>

<div id="outline-container-org0e61dbf" class="outline-3">
<h3 id="org0e61dbf"><span class="section-number-3">3.2</span> Discussion</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Sed tamen haec cum ita tutius observentur, quidam vigore artuum inminuto rogati
ad nuptias ubi aurum dextris manibus cavatis offertur, inpigre vel usque
Spoletium pergunt.
</p>
</div>
</div>
</div>

<div id="outline-container-org4e54260" class="outline-2">
<h2 id="org4e54260"><span class="section-number-2">4</span> Conclusions</h2>
<div class="outline-text-2" id="text-4">
<p>
Inter haec Orfitus praefecti potestate regebat urbem aeternam ultra modum
delatae dignitatis sese efferens insolenter, vir quidem prudens et forensium
negotiorum oppido gnarus, sed splendore liberalium doctrinarum minus quam
nobilem decuerat institutus, quo administrante seditiones sunt concitatae graves
ob inopiam vini:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><i>Sous-total</i></th>
<th scope="col" class="org-right">21.00</th>
<th scope="col" class="org-left">&euro;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><i>Taxe @ 21%</i></td>
<td class="org-right">4.41</td>
<td class="org-left">&euro;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Montant total</b></td>
<td class="org-right"><b>\large{25.41}</b></td>
<td class="org-left"><b>&euro;</b></td>
</tr>
</tbody>
</table>

<p>
Huius avidis usibus vulgus intentum ad motus asperos excitatur et crebros.
</p>
</div>
</div>

<div id="outline-container-org162c34c" class="outline-2">
<h2 id="org162c34c"><span class="section-number-2">5</span> Annexes</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org4b3dad5" class="outline-3">
<h3 id="org4b3dad5"><span class="section-number-3">5.1</span> Code Emacs Lisp</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Code utilisé pour améliorer le rendu de la démonstration :
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-frame-font <span class="org-string">"Consolas-13"</span> nil t)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-latex-default-packages-alist
      '((<span class="org-string">"AUTO"</span> <span class="org-string">"inputenc"</span> t
         (<span class="org-string">"pdflatex"</span>))
        (<span class="org-string">"T1"</span> <span class="org-string">"fontenc"</span> t
         (<span class="org-string">"pdflatex"</span>))
        (#1=<span class="org-string">""</span> <span class="org-string">"graphicx"</span> t)
        (<span class="org-string">""</span> <span class="org-string">"xcolor"</span>)
        (<span class="org-string">""</span> <span class="org-string">"babel"</span>)
        (<span class="org-string">""</span> <span class="org-string">"listings"</span>)
        (#1# <span class="org-string">"hyperref"</span> nil))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-latex-classes

      '((<span class="org-string">"article"</span> <span class="org-string">"\\documentclass[11pt]{article}"</span>
         (<span class="org-string">"\\section{%s}"</span> . <span class="org-string">"\\section*{%s}"</span>)
         (<span class="org-string">"\\subsection{%s}"</span> . <span class="org-string">"\\subsection*{%s}"</span>)
         (<span class="org-string">"\\subsubsection{%s}"</span> . <span class="org-string">"\\subsubsection*{%s}"</span>)
         (<span class="org-string">"\\paragraph{%s}"</span> . <span class="org-string">"\\paragraph*{%s}"</span>)
         (<span class="org-string">"\\subparagraph{%s}"</span> . <span class="org-string">"\\subparagraph*{%s}"</span>))

        (<span class="org-string">"report"</span> <span class="org-string">"\\documentclass[11pt]{report}"</span>
         (<span class="org-string">"\\chapter{%s}"</span> . <span class="org-string">"\\chapter*{%s}"</span>)
         (<span class="org-string">"\\section{%s}"</span> . <span class="org-string">"\\section*{%s}"</span>)
         (<span class="org-string">"\\subsection{%s}"</span> . <span class="org-string">"\\subsection*{%s}"</span>)
         (<span class="org-string">"\\subsubsection{%s}"</span> . <span class="org-string">"\\subsubsection*{%s}"</span>)
         (<span class="org-string">"\\paragraph{%s}"</span> . <span class="org-string">"\\paragraph*{%s}"</span>))

        (<span class="org-string">"book"</span> <span class="org-string">"\\documentclass[11pt]{book}"</span>
         (<span class="org-string">"\\chapter{%s}"</span> . <span class="org-string">"\\chapter*{%s}"</span>)
         (<span class="org-string">"\\section{%s}"</span> . <span class="org-string">"\\section*{%s}"</span>)
         (<span class="org-string">"\\subsection{%s}"</span> . <span class="org-string">"\\subsection*{%s}"</span>)
         (<span class="org-string">"\\subsubsection{%s}"</span> . <span class="org-string">"\\subsubsection*{%s}"</span>)
         (<span class="org-string">"\\paragraph{%s}"</span> . <span class="org-string">"\\paragraph*{%s}"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga89f5a8" class="outline-3">
<h3 id="orga89f5a8"><span class="section-number-3">5.2</span> Plus d&rsquo;informations</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Fichier d&rsquo;exemple de la syntaxe Org mode :
<a href="https://github.com/fniessen/org-html-themes/tests/org-mode-syntax-example.org">https://github.com/fniessen/org-html-themes/tests/org-mode-syntax-example.org</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7015599" class="outline-2">
<h2 id="org7015599"><span class="section-number-2">6</span> Suis-moi !</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Rejoins le groupe Facebook <br />
et la communauté des « <b>Boosters Emacs</b> » ici : <br />
<a href="https://www.facebook.com/groups/286810496172489">https://www.facebook.com/groups/286810496172489</a></li>

<li>Abonne-toi à la chaîne Youtube « <b>Booster Emacs</b> » <br />
<a href="https://www.youtube.com/channel/UChSzlv1RJWFbb7XkV7OREtA?sub_confirmation=1">https://www.youtube.com/channel/UChSzlv1RJWFbb7XkV7OREtA?sub_confirmation=1</a> <br />
et active les notifications en cliquant sur la petite cloche pour ne rien
rater !</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: Fabrice Niessen</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
